content/journal/03-19-Hiroshima-1945.org
#+TITLE: Hiroshima 1945
#+DATE: 1945-01-01
#+HUGO_BASE_DIR: ../../
#+HUGO_SECTION: stories
#+HUGO_TAGS: Civilians
+HUGO_CATEGORIES: World War II
#+EXPORT_FILE_NAME: 03-19-Hiroshima-1945.org
#+LOCATION: Japan
#+YEAR: 1945


Father John A. Siemes, a Jesuit priest, was residing at the Novitiate of the Society of Jesus in Nagatsuke, approximately two kilometers from Hiroshima's center. At 8:14 a.m., he witnessed a blinding flash, followed by a wave of heat and a powerful blast that shattered windows and doors. Fires erupted across the city, and soon, streams of injured and burned individuals sought refuge at the Novitiate. Siemes and his colleagues provided first aid, despite limited medical supplies. He later ventured into the city, describing it as a "gigantic burned-out scar," with countless dead and wounded.

The atomic bomb had obliterated Hiroshima, resulting in tens of thousands of deaths and leaving survivors with lasting physical and psychological scars.

**Source:** [[https://www.atomicarchive.com/resources/documents/hiroshima-nagasaki/hiroshima-siemes.html][Atomic Archive]]
