public/essays/03-19-hiroshima-1945/index.html
<!DOCTYPE html>
<html lang="en-us" data-theme="light">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>36 Nagasaki 1945 - Against The Tide</title>
    
    
    <meta name="description" content="A series of fact-based civilian experience essays documenting U.S. military bombardments">
    <meta name="keywords" content="journalism, civilian, military, bombardment, essays, history">
    <meta name="author" content="TorchScribe">
    
    
    <meta property="og:type" content="article">
    <meta property="og:title" content="36 Nagasaki 1945 - Against The Tide">
    <meta property="og:description" content="A series of fact-based civilian experience essays documenting U.S. military bombardments">
    <meta property="og:url" content="https://torchscribe.com/essays/03-19-hiroshima-1945/">
    
    
    <link href="https://fonts.googleapis.com/css2?family=Inter:wght@400;500;600;700&family=JetBrains+Mono:wght@400;700&display=swap" rel="stylesheet">
    <link rel="stylesheet" href="/css/style.css">
    
    
    <link rel="icon" type="image/svg+xml" href="/img/favicon.svg">
    <link rel="icon" type="image/png" href="/img/favicon.png">
    
    
</head>
<body>
    <div class="container">
        <header>
    <div class="logo">Against <span>The</span> Tide</div>
    <nav>
        
        
        <a href="/" >Home</a>
        
        <a href="/#essays" >Essays</a>
        
        <a href="/about/" >About</a>
        
        <button id="theme-toggle" aria-label="Toggle dark mode">
            <span class="theme-toggle-icon">◐</span>
        </button>
    </nav>
</header>

        <main>
            
<article class="essay-content markdown-content">
    <header class="essay-header">
        <h1>36 Nagasaki 1945</h1>
        <div class="metadata">
            <p><strong>Location:</strong> </p>
            <p><strong>Year:</strong> </p>
        </div>
    </header>
    
    <div class="essay-article">
        
<p>
Father John A. Siemes, a Jesuit priest, was residing at the Novitiate of the Society of Jesus in Nagatsuke, approximately two kilometers from Hiroshima&#39;s center. At 8:14 a.m., he witnessed a blinding flash, followed by a wave of heat and a powerful blast that shattered windows and doors. Fires erupted across the city, and soon, streams of injured and burned individuals sought refuge at the Novitiate. Siemes and his colleagues provided first aid, despite limited medical supplies. He later ventured into the city, describing it as a &#34;gigantic burned-out scar,&#34; with countless dead and wounded.</p>
<p>
The atomic bomb had obliterated Hiroshima, resulting in tens of thousands of deaths and leaving survivors with lasting physical and psychological scars.</p>
<p>
<strong><strong>Source:</strong></strong> [Atomic Archive](<a href="https://www.atomicarchive.com/resources/documents/hiroshima-nagasaki/hiroshima-siemes.html)">https://www.atomicarchive.com/resources/documents/hiroshima-nagasaki/hiroshima-siemes.html)</a></p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Sources
</h2>
</div>

    </div>
    
    
    
    <div class="essay-navigation">
        <a href="/#essays" class="back-to-essays">← Back to Essays</a>
    </div>
</article>

        </main>

        <footer>
    <p>© 2025 Against The Tide · All rights reserved</p>
    <p>Curated by TorchScribe</p>
</footer>
    </div>

    <script>
    
    document.addEventListener('DOMContentLoaded', () => {
        const themeToggle = document.getElementById('theme-toggle');
        
        themeToggle.addEventListener('click', () => {
            const currentTheme = document.documentElement.getAttribute('data-theme');
            const newTheme = currentTheme === 'dark' ? 'light' : 'dark';
            
            setTheme(newTheme);
        });
    });
    
    
    document.addEventListener('keydown', (e) => {
        
        if (e.altKey && e.key === 's') {
            e.preventDefault();
            window.location.href = '/#essays';
        }
        
        
        if (e.altKey && e.key === 'Home') {
            e.preventDefault();
            window.location.href = '/';
        }
        
        
        if (e.altKey && e.key === 'e') {
            e.preventDefault();
            window.location.href = '/#essays';
        }
        
        
        if (e.altKey && e.key === 'a') {
            e.preventDefault();
            window.location.href = '/about/';
        }
    });
</script>
</body>
</html>